In [ ]:
"""
Not Boring Movies

Table: Cinema

+----------------+----------+
| Column Name    | Type     |
+----------------+----------+
| id             | int      |
| movie          | varchar  |
| description    | varchar  |
| rating         | float    |
+----------------+----------+
id is the primary key for this table.
Each row contains information about the name of a movie, its genre, and its rating.
rating is a 2 decimal places float in the range [0, 10]
 

Write an SQL query to report the movies with an odd-numbered ID and a description that is not "boring".

Return the result table in descending order by rating.
"""

In [ ]:
"""testcase"""
{"headers":{"cinema":["id", "movie", "description", "rating"]},
 "rows":{"cinema":[[1, "War", "great 3D", 8.9], 
                   [2, "Science", "fiction", 8.5], 
                   [3, "irish", "boring", 6.2], 
                   [4, "Ice song", "Fantacy", 8.6], 
                   [5, "House card", "Interesting", 9.1]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABLE IF EXISTS Cinema;

CREAT TABLE Cinema(
id int(4) NOT NULL,
movie varchar(50) NOT NULL,
description varchar(50) NOT NULL,
rating float(4) NOT NULL,
PRIMARY KEY ('id'));

INSERT INTO Cinema VALUES
(1, "War", "great 3D", 8.9), 
(2, "Science", "fiction", 8.5), 
(3, "irish", "boring", 6.2), 
(4, "Ice song", "Fantacy", 8.6), 
(5, "House card", "Interesting", 9.1);

In [ ]:
"""SQL solution"""
SELECT *
FROM Cinema
WHERE id % 2 = 1
AND description != 'boring'
ORDER BY rating DESC

In [3]:
"""pandas dataframe creation"""
import pandas as pd

testcase = {"headers":{"cinema":["id", "movie", "description", "rating"]},
 "rows":{"cinema":[[1, "War", "great 3D", 8.9], 
                   [2, "Science", "fiction", 8.5], 
                   [3, "irish", "boring", 6.2], 
                   [4, "Ice song", "Fantacy", 8.6], 
                   [5, "House card", "Interesting", 9.1]]}}
Cinema = pd.DataFrame(testcase['rows']['cinema'], columns=testcase['headers']['cinema'])
Cinema.head()

   id       movie  description  rating
0   1         War     great 3D     8.9
1   2     Science      fiction     8.5
2   3       irish       boring     6.2
3   4    Ice song      Fantacy     8.6
4   5  House card  Interesting     9.1

In [8]:
Cinema.loc[(Cinema['id']%2 == 1) & (Cinema['description'] != 'boring')].sort_values(by='rating', ascending=False)

   id       movie  description  rating
4   5  House card  Interesting     9.1
0   1         War     great 3D     8.9